Revit 2024 API
StructuralConnectionHandler.IsDetailed Method
 Checks if Structural Connection Handler has the detailed connection style.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsDetailed()
Visual Basic
Public Function IsDetailed As Boolean
Visual C++
public:
bool IsDetailed()
Return Value
 True if Structural Connection Handler has the detailed connection style.
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace